In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv("Games.csv")
print(df1)

   Team Member Name   Game  Points
0     A     Gayatri  Chess      10
1     B    Shantanu  Chess       9
2     A         Jui  Chess       5
3     C     Atharva  Chess       3
4     A       Mihir  Chess       6
5     B      Akshay  Chess       8
6     C       Pooja  Chess       6
7     A         Jay  Chess       2
8     B     Anushka  Chess       8
9     C       Gargi  Chess       5
10    C       Anish  Chess       8
11    B   Maitreyee  Chess       4

In [12]:
df1.groupby("Team")["Points"].count()

Team
A    4
B    4
C    4
Name: Points, dtype: int64

In [14]:
df1.groupby("Team")["Points"].sum()

Team
A    23
B    29
C    22
Name: Points, dtype: int64

In [17]:
df1.groupby("Team")["Points"].mean()

Team
A    5.75
B    7.25
C    5.50
Name: Points, dtype: float64

In [18]:
df1.groupby("Team")["Points"].median()

Team
A    5.5
B    8.0
C    5.5
Name: Points, dtype: float64

In [19]:
df1.groupby("Team")["Points"].min()

Team
A    2
B    4
C    3
Name: Points, dtype: int64

In [20]:
df1.groupby("Team")["Points"].max()

Team
A    10
B     9
C     8
Name: Points, dtype: int64

In [15]:
df2 = df1.groupby("Team")
df2.first()

     Member Name   Game  Points
Team
A        Gayatri  Chess      10
B       Shantanu  Chess       9
C        Atharva  Chess       3

In [16]:
df2.get_group("B")["Points"].mean()

7.25

In [24]:
dataframe1 = {"Sr. no": [1, 2, 3, 4, 5, 6], 
              "Region": ["South", "North", "North", "South", "North", "South"], 
              "Name": ["Sid", "Rocky", "Aksa", "Aamaira", "Sam", "William"], 
              "Product": ["Shampoo", "Soap", "Soap", "Soap", "Shampoo", "Shampoo"], 
              "Price": [200, 60, 90, 50, 180, 220]}

dataframe1 = pd.DataFrame(dataframe1)

In [26]:
dataframe1.pivot_table(index="Region", columns="Product", values="Price")

Product  Shampoo  Soap
Region
North        180    75
South        210    50

In [27]:
dataframe1.pivot_table(index="Region", columns="Product", values="Price", aggfunc="sum")

Product  Shampoo  Soap
Region
North        180   150
South        420    50

In [28]:
dataframe1.pivot_table(index="Region", columns="Product", values="Price", aggfunc="min")

Product  Shampoo  Soap
Region
North        180    60
South        200    50

In [29]:
dataframe1.pivot_table(index="Region", columns="Product", values="Price", aggfunc="median")

Product  Shampoo  Soap
Region
North        180    75
South        210    50

In [30]:
dataframe1.pivot_table(index="Region", columns="Product", values="Price", aggfunc="min")

Product  Shampoo  Soap
Region
North        180    60
South        200    50

In [31]:
dataframe1.pivot_table(index="Region", columns="Product", values="Price", aggfunc="max")

Product  Shampoo  Soap
Region
North        180    90
South        220    50

In [32]:
dataframe1.pivot_table(index="Region", columns="Product", values="Price", aggfunc="count")

Product  Shampoo  Soap
Region
North          1     2
South          2     1

In [33]:
dataframe2 = {"Sr. no": [1, 2, 3, 4, 5, 6], 
              "Region": ["East", "West", "West", "East", "East", "West"], 
              "Name": ["Siddharth", "Ariz", "Ekansh", "Lakshay", "Edward", "Mary"], 
              "Product": ["Shampoo", "Soap", "Soap", "Soap", "Shampoo", "Shampoo"], 
              "Price": [230, 320, 120, 80, 110, 260]}

dataframe2 = pd.DataFrame(dataframe2)

In [34]:
df3 = pd.pivot_table(dataframe1, index="Region", columns="Product", values="Price", aggfunc="sum")
df4 = pd.pivot_table(dataframe2, index="Region", columns="Product", values="Price", aggfunc="sum")

In [35]:
pd.concat([df3, df4], axis=0)

Product  Shampoo  Soap
Region
North        180   150
South        420    50
East         340    80
West         260   440

In [37]:
pd.merge(df3, df4, how="outer", on=["Region"])

Product  Shampoo_x  Soap_x  Shampoo_y  Soap_y
Region
North        180.0   150.0        NaN     NaN
South        420.0    50.0        NaN     NaN
East           NaN     NaN      340.0    80.0
West           NaN     NaN      260.0   440.0

Converting to csv/xlsx

In [38]:
df1.to_csv("Testing.csv")
new_file = pd.read_csv("Testing.csv")

In [41]:
df1.to_excel("Testing.xlsx")
new_file = pd.read_excel("Testing.xlsx")
print(new_file)

Collecting openpyxlNote: you may need to restart the kernel to use updated packages.

  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

WARNING: You are using pip version 21.2.4; however, version 23.1.2 is available.
You should consider upgrading via the 'c:\Users\deepa\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.